12/data/attachments/7df549d3b848bf71.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_ebe2820c-d17a-4dd8-8073-0d69b67fb790</nif:username>
            <nif:friendToBeAdded>Sarah_perhaps_Actions_78888_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>